In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
import webbrowser
website = "http://en.wikipedia.org/wiki/NFL_win-loss_records"
webbrowser.open(website)

True

In [33]:
nfl_dict  = {'Rank': [1,2,3,4,5], 'Team': ['Dallas Cowboys', 'Green Bay Packers', 'Chicago Bears', 'Miami Dolphins','New Englaand Patriotss'], 'Won':[511,730,744,439,476], 'Lost':[367,553,568,341,383]}
nfl_frame  = DataFrame(data=nfl_dict)
nfl_frame

   Lost  Rank                    Team  Won
0   367     1          Dallas Cowboys  511
1   553     2       Green Bay Packers  730
2   568     3           Chicago Bears  744
3   341     4          Miami Dolphins  439
4   383     5  New Englaand Patriotss  476

In [12]:
nfl_frame.columns

Index(['Lost', 'Rank', 'Team', 'Won'], dtype='object')

In [13]:
nfl_frame['Team']

0            Dallas Cowboys
1         Green Bay Packers
2             Chicago Bears
3            Miami Dolphins
4    New Englaand Patriotss
Name: Team, dtype: object

In [24]:
nfl_frame[['Team','Rank', 'Won']]

                     Team  Rank  Won
0          Dallas Cowboys     1  511
1       Green Bay Packers     2  730
2           Chicago Bears     3  744
3          Miami Dolphins     4  439
4  New Englaand Patriotss     5  476

In [26]:
nfl_frame.head()

   Lost  Rank                    Team  Won
0   367     1          Dallas Cowboys  511
1   553     2       Green Bay Packers  730
2   568     3           Chicago Bears  744
3   341     4          Miami Dolphins  439
4   383     5  New Englaand Patriotss  476

In [32]:
nfl_frame.ix[3]

Lost               341
Rank                 4
Team    Miami Dolphins
Won                439
Name: 3, dtype: object

In [36]:
nfl_frame['Team'] = 'Team Name'

In [35]:
nfl_frame

   Lost  Rank       Team  Won
0   367     1  Team Name  511
1   553     2  Team Name  730
2   568     3  Team Name  744
3   341     4  Team Name  439
4   383     5  Team Name  476

In [37]:
nfl_frame  = DataFrame(data=nfl_dict)

In [38]:
nfl_frame

   Lost  Rank                    Team  Won
0   367     1          Dallas Cowboys  511
1   553     2       Green Bay Packers  730
2   568     3           Chicago Bears  744
3   341     4          Miami Dolphins  439
4   383     5  New Englaand Patriotss  476

In [42]:
stadium = Series(['Levis Staadium', 'AT&T Stadium'],index=[4,0])
stadium

4    Levis Staadium
0      AT&T Stadium
dtype: object

In [44]:
nfl_frame['Stadium'] = stadium
nfl_frame

   Lost  Rank                    Team  Won         Stadium
0   367     1          Dallas Cowboys  511    AT&T Stadium
1   553     2       Green Bay Packers  730             NaN
2   568     3           Chicago Bears  744             NaN
3   341     4          Miami Dolphins  439             NaN
4   383     5  New Englaand Patriotss  476  Levis Staadium

In [45]:
del nfl_frame['Stadium']

In [46]:
nfl_frame

   Lost  Rank                    Team  Won
0   367     1          Dallas Cowboys  511
1   553     2       Green Bay Packers  730
2   568     3           Chicago Bears  744
3   341     4          Miami Dolphins  439
4   383     5  New Englaand Patriotss  476